"use client";

import { useState } from "react";
import { useRouter } from "next/navigation";

export default function InfoGraphic() {
    const router = useRouter();
    const [selected, setSelected] = useState(null);
    

    const items = [
        {
            name: "6 วิธีเพื่อรับมือและป้องกันภาวะซึมเศร้าหลังวันหยุดยาว",
            path: "/Infographic/1.jpg",
            detail: "ภาวะซึมเศร้าหลังวันหยุดยาวเกิดขึ้นได้บ่อยมากในวัยเรียนและวัยทำงาน คำแนะนำนี้จะช่วยให้คุณปรับตัวได้ง่ายขึ้น",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        ,
        {
            name: "ประเด็นวัยสูงอายุ : ดูแลใจ สูงวัยอยู่ลำพัง…รับมือกับความเหงาและความสูญเสีย",
            path: "/Infographic/3.jpg",
            detail: "สถานการณ์ผู้สูงอายุที่อยู่ตามลำพัง สาเหตุของความเหงาในผู้สูงอายุ สัญญาณเตือนผู้สูงอายุเสี่ยงเหงาและโดดเดี่ยว การรับมือกับความเหงาที่ต้องอยู่ลำพัง การรับมือกับความเศร้าโศกจากความสูญเสียคู่ชีวิตหรือบุคคลอันเป็นที่รัก ระยะของการปรับตัวเมื่อเกิดการสูญเสีย อาการโศกเศร้าในผู้สูงอายุ ความแตกต่างระหว่างภาวะเศร้าโศกที่เป็นปกติและผิดปกติ เทคนิคการเพิ่มพลังใจ การเช็คและวิธีดูแลสุขภาพใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยทำงาน : “ความสุขก็สร้างได้ เครียดก็คลายให้เป็น”",
            path: "/Infographic/4.jpg",
            detail: "ความหมายของความเครียด สำรวจความเครียดด้วยตนเอง และการใช้แบบประเมินความเครียด วิธีผ่อนคลายความเครียด และวิธีคลายเครียดด้วยเทคนิคต่างๆ การใช้แบบประเมินความสุข วิธีสร้างสุข การคิดบวกและมองโลกในแง่ดี การพัฒนาความคิดเชิงบวก และการตรวจสุขภาพใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2/",
        },
        {
            name: "ทำความรู้จัก 5 ปัญหาสุขภาพจิตคุกคามชีวิตวัยทำงาน  ว่าตัวเรานั้น เข้าข่ายหมดไฟในการทำงานไหมนะ",
            path: "/Infographic/2.jpg",
            detail: "5 ปัญหาสุขภาพจิตคุกคามชีวิตวัยทำงาน ว่าตัวเรานั้น เข้าข่ายหมดไฟในการทำงานไหมนะ \n1. เครียดสะสมการใช้ชีวิตบนความตึงเครียด ความกดดัน และมีความคาดหวังสูง 5-6 วันต่อสัปดาห์ มักเป็นสาเหตุของอาการเครียดสะสม หนึ่งในปัญหาสุขภาพจิตที่หลายคนเป็นแต่ไม่รู้ตัว เรียกได้ว่ารู้ตัวอีกทีก็อาจส่งผลกระทบต่อการทำงานและคนรอบข้างไปแล้ว สังเกตได้จากพฤติกรรมที่เปลี่ยนไปทั้งด้านอารมณ์และการใช้ชีวิต เช่น นอนไม่หลับ ตื่นกลางดึก นิ่งเงียบ เบื่อหน่ายชีวิต เศร้าหมอง ความต้องการทางเพศลดลง เป็นต้น ซึ่งหากปล่อยทิ้งไว้อาจกลายเป็นภาวะอันตรายที่นำไปสู่ความเสี่ยงต่อการเกิดโรคทางกายตามมาได้ ทั้งหัวใจ ความดันโลหิต ไมเกรน เครียดลงกระเพาะ และอื่นๆ ได้ \n2. ภาวะหมดไฟในการทำงานเรียกได้ว่าเป็นปัญหาสุขภาพจิตที่กำลังมาแรงในกลุ่มพนักงานออฟฟิศ คือภาวะการเปลี่ยนแปลงทางด้านจิตใจอันมีที่มาจากความเครียดสะสม โดยสาเหตุมักเกิดจากความเครียดเรื้อรังในการทำงาน ภาระงานที่หนักซับซ้อนเกินกว่าที่จะรับผิดชอบได้ไหว บั่นทอนจิตใจ จนกลายสภาพเป็นความหมดไฟในที่สุด ความเหนื่อยล้าทางอารมณ์ส่งผลให้มุมมองที่มีต่อการทำงานเป็นไปในด้านลบ ขาดความสุข หมดแรงจูงใจไม่อยากไปออฟฟิต และอาจส่งผลให้ประสิทธิภาพในการทำงานต่ำลง ซึ่งหากปล่อยให้นานอาจมีแนวโน้มรุนแรงขึ้นและเสี่ยงต่อการเกิดโรคซึมเศร้าได้\n3. ภาวะความพึงพอใจในตนเองต่ำ ปัญหาสุขภาพจิตที่ชาวออฟฟิศหลายคนไม่รู้ตัวว่ากำลังเผชิญภาวะนี้อยู่ คือ ความรู้สึกเศร้าใจ ไม่ชอบสิ่งที่ตัวเองได้ตัดสินใจทำลงไป รู้สึกว่าตัวเองไม่มีคุณค่า สูญเสียความรู้สึกให้เกียรติตัวเอง แบกรับปัญหาและกล่าวโทษว่ามีต้นเหตุมาจากตัวเองไม่ดีพอ ตีความเหตุการณ์ต่างๆ ในแง่ลบเสมอ เป็นภาวะเสี่ยงมากที่จะก้าวข้ามสู่โรคซึมเศร้า สัญญาณเตือนที่เห็นได้ชัดเจนสำหรับผู้กำลังเผชิญวิกฤติ ภาวะความพึงพอใจในตนเองต่ำ คือความอ่อนไหวไปกับเรื่องเล็กน้อยได้ง่าย วิตกกังวล ไปจนถึงกลัวการเข้าสังคม เพราะกลัวที่ต้องถูกปฏิเสธ ขณะเดียวกันก็ไม่กล้าปฏิเสธคำขอของผู้อื่นเนื่องจากกลัวไม่เป็นที่ยอมรับ ซึ่งอาการเหล่านี้เกิดจากการขาดความเชื่อมั่นและศรัทธาในตนเองที่สะสมมาเป็นเวลานาน \n 4. โรคซึมเศร้า เป็นการเจ็บป่วยอย่างหนึ่งเช่นเดียวกับโรคทางกายชนิดอื่นๆ การเป็นโรคซึมเศร้าไม่ได้มีความหมายว่าเป็นคนอ่อนแอ หรือไร้ความสามารถ แต่เกิดจากความไม่สมดุลของสารสื่อประสาทในสมอง ที่มีผลกระทบโดยรวมต่ออารมณ์ ความรู้สึก พฤติกรรม ไปจนถึงสุขภาพกาย ปัจจัยเสี่ยงที่มาพร้อมความเครียดจากการทำงาน ความกดดันจากการทำงาน สภาพสังคม และสิ่งแวดล้อม ล้วนมีส่วนสำคัญที่ทำให้เกิดภาวะซึมเศร้า\n5. กลุ่มโรควิตกกังวลและแพนิคเป็นโรควิตกกังวลชนิดหนึ่ง เกิดจากระบบประสาทอัตโนมัติที่คอยควบคุมส่วนต่างๆ ของร่างกายทำงานผิดปกติ รวมถึงมีความเครียดและความกดดันเข้ามาเป็นตัวกระตุ้น มักแสดงอาการได้หลายอย่างร่วมกัน เช่น หัวใจเต้นแรง ใจสั่น เหงื่อออกมาก หายใจหอบ อาเจียน วิงเวียนแบบฉับพลัน ตัวชา ควบคุมตัวเองไม่ได้ ไปจนถึงการหวาดกลัวสิ่งรอบตัวจนส่งผลกระทบต่อชีวิตประจำวัน ซึ่งเป็นอีกหนึ่งปัญหาสุขภาพจิตที่คุกคามชีวิตของคนวัยทำงานไม่มากก็น้อย\nปัญหาสุขภาพจิตเป็นปัญหาที่สามารถเกิดได้กับทุกเพศ ทุกอาชีพ และทุกวัย ปัจจุบันมีคนไทยจำนวนไม่น้อยพบเจอกับความเครียดจนสะสมเป็นปัญหาสุขภาพจิต โดยเฉพาะวัยทำงานอย่างมนุษย์ออฟฟิศทั้งหลาย หมั่นสังเกตตัวเองว่ามีปัญหาเหล่านี้หรือไม่หากพบสัญญาณเตือนเหล่านี้ หรือกำลังประสบปัญหาด้านสุขภาพจิต สามารถติดต่อปรึกษาจิตแพทย์ผู้เชี่ยวชาญ #สายด่วน1323",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        },
        {
            name: "ประเด็นวัยเรียน : “การกลั่นแกล้งรังแกกัน ไม่ใช่เรื่องล้อเล่น",
            path: "/Infographic/2.jpg",
            detail: "การกลั่นแกล้งในวัยเรียนส่งผลต่อสุขภาพจิตระยะยาว Infographic นี้ชวนให้ตระหนักและรับมืออย่างเข้าใจ",
            credit: "https://mhc7.dmh.go.th/09/05/2024/17856-2-2-2-2-2-2/",
        }
    ];

    const handleInfo = (item) => {
        const query = new URLSearchParams({
            name: item.name,
            detail: item.detail,
            path: item.path,
            credit: item.credit || ""
        });

        router.push(`/infographic-detail?${query.toString()}`);
    }

    return (
        <div className="bg-gradient-to-br from-green-100 via-green-200 to-green-200 min-h-screen py-12">
            <div className="bg-white p-8 mx-6 mb-10 shadow-2xl rounded-3xl border-2 border-white/50 backdrop-blur-md">
                <h1 className="text-center text-4xl font-extrabold text-green-700 drop-shadow-md tracking-wide">
                    Info Graphic ความรู้
                </h1>
                <hr className="mt-6 mb-6 border-t-2 border-green-200" />

                <div className="grid grid-cols-1 sm:grid-cols-2 md:grid-cols-3 lg:grid-cols-4 xl:grid-cols-5 gap-8 px-6">
                    {items.map((src, index) => (
                        <div
                            key={index}
                            onClick={() => handleInfo(src)}
                            className="bg-white rounded-2xl overflow-hidden shadow-lg hover:shadow-2xl transition-all duration-300 border border-gray-100 hover:scale-105 flex flex-col cursor-pointer"
                        >
                            <div className="h-44 w-full overflow-hidden">
                                <img
                                    src={src.path}
                                    alt={`Infographic ${index + 1}`}
                                    className="w-full h-full object-cover"
                                />
                            </div>
                            <div className="p-4 flex-1 flex items-center justify-center">
                                <p className="text-sm text-gray-700 text-center font-medium">
                                    {src.name}
                                </p>
                            </div>
                        </div>
                    ))}
                </div>
            </div>

            {selected && (
                <div
                    className="fixed inset-0 bg-black/50 flex items-center justify-center z-50 transition-all duration-300"
                    onClick={() => setSelected(null)}
                >
                    <div
                        className="bg-white rounded-xl max-w-2xl w-full mx-4 shadow-xl overflow-hidden relative"
                        onClick={(e) => e.stopPropagation()}
                    >
                        <button
                            className="absolute top-2 right-2 text-gray-600 hover:text-red-500 text-xl font-bold"
                            onClick={() => setSelected(null)}
                        >
                            &times;
                        </button>

                        <img
                            src={selected.path}
                            alt="Selected"
                            className="w-full h-80 object-cover"
                        />
                        <div className="p-6">
                            <h2 className="text-xl font-bold text-green-700 mb-2">
                                {selected.name}
                            </h2>
                            <p className="text-gray-600 text-sm leading-relaxed">
                                {selected.detail}
                            </p>
                            {selected.credit ? (
                                <a
                                    href={selected.credit}
                                    target="_blank"
                                    rel="noopener noreferrer"
                                    className="text-blue-500 text-sm underline hover:text-blue-700 transition-all"
                                >
                                    แหล่งที่มา
                                </a>
                            ) : (
                                <p className="text-gray-600 text-sm leading-relaxed">
                                    ไม่มีแหล่งที่มา
                                </p>
                            )}

                        </div>
                    </div>
                </div>
            )}
        </div>
    );
}
